"""
    ТЕМА: if elif else
"""

# number = 9
#
# if number == 7:
#     print(7)
# elif number == 8:
#     print(8)
# elif number == 5:
#     print(5)
# else:
#     print("Эч кандай сан дал келген жок")


# age = int(input("Enter your age: "))
#
# if age < 16:
#     print("Тилекке каршы, сизге паспорт берилбейт!")
# else:
#     print("Сиз паспорт ала аласыз!")

# x = int(input("x: "))
# option = input("+, -, /, *:    ")
# y = int(input("y: "))
#
# if option == "+":
#     print(x + y)
# elif option == "-":
#     print(x - y)
# elif option == "/":
#     if y == 0:
#         print("Infinity")
#     else:
#         print(x / y)
# else:
#     print(x * y)

# print("10 + 10 =", 10 + 10)
# print("20 - 5 =", 20 - 5, "!")
# print(f"10 + 10 = {10 + 10}\n"
#       f"20 - 5 = {20 - 5} !")

print(f"Кел чогуу оюн ойнойбуз!\n"
      f"Мен сага кызыктуу фактыларды айтам, а сен болсо\n"
      f"Эгерде факт туура болсо ч\n"
      f"Факт туура эмес болсо ж\n"
      f"деп жазасын!")

count = 0

question1 = input(f"1) 1811-жылы 16-декабрда күчтүү жер титирөө болуп, \n"
                  f"Миссисипи дарыясынын суулары тескери агып кеткен.")

if question1 == "ч":
    print("Азаматсыз жооп туура!")
    count += 5
elif question1 == "ж":
    print("Тилекке каршы жооп туура эмес!")
else:
    print("'ч' же 'ж' тамгасын жазыныз")


question2 = input(f"2) Дүйнөдөгү эң эски лампочка Калифорниянын Ливермор өрт өчүрүүчү жайында табылган. \n"
                  f"Ал 115 жылдан ашуун убакыттан бери иштеп келе жатат жана дагы деле өчүрүлө элек. ")

if question2 == "ч":
    print("Азаматсыз жооп туура!")
    count += 5
elif question2 == "ж":
    print("Тилекке каршы жооп туура эмес!")
else:
    print("'ч' же 'ж' тамгасын жазыныз")


question3 = input(f"3) Дүйнөдөгү эң терең почта ящиги Япониянын Сусами булуңунда жайгашкан. \n"
                  f"Тактап айтканда, суу астында 9 метр. ")

if question3 == "ч":
    print("Маани берип окуп жүрүнүз!")
elif question3 == "ж":
    print("Азаматсыз жооп туура!")
    count += 5
else:
    print("'ч' же 'ж' тамгасын жазыныз")


question4  = input(f"4) Адамдар компьютердин бетиндеги жазууларды барактагы текстке салыштырмалуу 25 % жай окуйт.")

if question4 == "ч":
    count += 5
    print("Азаматсыз жооп туура!")
elif question4 == "ж":
    print("Тилекке каршы жооп туура эмес!")
else:
    print("'ч' же 'ж' тамгасын жазыныз")
print(f"Сиздин топтогон баллыныз: {count}")


